# ==========================================
# 1. ОБЩИЕ НАСТРОЙКИ (ВВОД/ВЫВОД)
# ==========================================

# Путь к входным изображениям
INPUT_DIR = 'data/input'
# Путь к выходным изображениям
OUTPUT_DIR = 'data/output'
# Путь к исходным тайлам для нейросети
TILES_DIR = "data/temp/tiles"
# Путь к предсказаниям для нейросети
PREDICTED_TILES_DIR = "data/temp/predicted_tiles"
# Корневая папка для сохранения промежуточных результатов
TEMP_DIR = "data/temp"

# Путь к идеальной маске для демонстрации шагов 4.3-4.8
DEMO_REFERENCE_MASK_PATH = INPUT_DIR + '/reference_masks'
# Путь к исходной карте (изображению)
INFERENCE_IMAGE_PATH = INPUT_DIR + "/map_images"

# Путь к результату алгоритма построения ЦМР
OUTPUT_DEMO_PATH = OUTPUT_DIR + "/demo.png"
# Путь к предсказанию нейронной сети
OUTPUT_INFERENCE_PATH = OUTPUT_DIR + "/unet_result.png"

# Цвета для классов (RGB)
RED = [255, 0, 0] #
BLUE = [0, 0, 255]
PINK = [255, 0, 255]
CYAN = [0, 255, 255]
ORANGE = [255, 127, 0]
PURPLE = [127, 0, 127]
BLACK = [0, 0, 0]
WHITE = [255, 255, 255]

# Путь к обученной модели U-Net
MODEL_PATH = "models/unet_model.keras"

CLASS_TO_COLOR = {
    0: (255, 255, 255),
    1: (255, 0, 0),
    2: (255, 0, 255),
    3: (0, 0, 255),
    4: (0, 255, 255),
}
# ==========================================
# 2. ПАРАМЕТРЫ ИЗМЕНЕНИЯ РАЗМЕРА ИЗОБРАЖЕНИЯ (Этап 4.1)
# ==========================================
TARGET_WIDTH = 2048
TARGET_HEIGHT = 1536
PAD_COLOR = [255, 255, 255]

# ==========================================
# 2. ПАРАМЕТРЫ СШИВКИ (Этап 4.1)
# ==========================================
TILE_SIZE = 1024         # Исходный размер тайла, который подавался в нейронку (для примера)
OVERLAP = 256
PAD = 128
STEP = 768

# ==========================================
# 3. ПАРАМЕТРЫ ГРАНИЦЫ КАРТЫ (Этап 4.2)
# ==========================================
DELAUNAY_RATIO = 1.0    # Коэффициент относительного сжатия для удаления симплексов
EXPAND_PIXELS = 10      # Размер увеличения контура

# ==========================================
# 4. ПАРАМЕТРЫ ПРОДЛЕНИЯ ЛИНИЙ (Этап 4.3)
# ==========================================
MIN_SKELETON_LINE_LENGTH = 5 # Минимальная длина линии (в пикселях) для фильтрации артефактов
LASER_MAX_WIDTH = 3.5
VECTOR_LOOKBACK = 5
REPULSION_RADIUS = 50
DIRECTIONAL_STIFFNESS = 50.0

# ==========================================
# 5. ПАРАМЕТРЫ ВЫСОТ И ГРАФА (Этап 4.5)
# ==========================================
HEIGHT_STEP = 1000                # Шаг высоты между горизонталями (кратно 4)
START_HEIGHT = HEIGHT_STEP     # Стартовая высота для самой низкой точки (не меньше HEIGHT_STEP)
NO_DATA_VALUE = 65535

# ==========================================
# 6. ПАРАМЕТРЫ ВСПОМОГАТЕЛЬНЫХ ЛИНИЙ (Этап 4.6)
# ==========================================
MIN_ARTIFACT_LENGTH = 5 # Порог длины для удаления артефактных отрезков после разрыва (в пикселях)

# ==========================================
# 7. ПАРАМЕТРЫ ГЕНЕРАЦИИ ЦМР (Этап 4.7 и 4.8)
# ==========================================
MEDIAN_FILTER_SIZE = 3 # Размер ядра медианного фильтра для финального сглаживания карты высот
